Feeeeerran/microcontroladores_proyecto/stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define sensor_Pin GPIO_PIN_0
#define sensor_GPIO_Port GPIOA
#define sensor_EXTI_IRQn EXTI0_IRQn
#define led2_Pin GPIO_PIN_3
#define led2_GPIO_Port GPIOA
#define led1_Pin GPIO_PIN_4
#define led1_GPIO_Port GPIOA
#define led0_Pin GPIO_PIN_5
#define led0_GPIO_Port GPIOA
#define servo1_Pin GPIO_PIN_6
#define servo1_GPIO_Port GPIOA
#define servo2_Pin GPIO_PIN_7
#define servo2_GPIO_Port GPIOA
#define servo3_Pin GPIO_PIN_0
#define servo3_GPIO_Port GPIOB
#define servo4_Pin GPIO_PIN_1
#define servo4_GPIO_Port GPIOB
#define led_alerta_Pin GPIO_PIN_10
#define led_alerta_GPIO_Port GPIOB
#define final_carrera_Pin GPIO_PIN_11
#define final_carrera_GPIO_Port GPIOB
#define final_carrera_EXTI_IRQn EXTI15_10_IRQn
#define motor2_dir2_Pin GPIO_PIN_12
#define motor2_dir2_GPIO_Port GPIOB
#define motor2_dir1_Pin GPIO_PIN_13
#define motor2_dir1_GPIO_Port GPIOB
#define motor2_pwm_Pin GPIO_PIN_9
#define motor2_pwm_GPIO_Port GPIOA
#define motor1_pwm_Pin GPIO_PIN_10
#define motor1_pwm_GPIO_Port GPIOA
#define motor1_dir_Pin GPIO_PIN_11
#define motor1_dir_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
